## Plan Result (stg-frontdoor)




<pre><code>Plan: 40 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.frontdoor_for_testing_migration.azurerm_frontdoor.main
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;c100-application&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;darts-portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;pip-frontend&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;pip-frontend-b2c-staff&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;portal-stg&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;staging-casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;staging-certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;staging-courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;staging-immigrationappealsonline&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;darts-portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-staff&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;portal-stg&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-immigrationappealsonline&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-admin-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-care-standards&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-cicap&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-employment-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-finance-tax&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-immigration-svcs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-info-rights&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-land-reg-division&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-lands-chamber&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-tansport-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontdoor_for_testing_migration.azurerm_frontdoor.main will be created
  + resource "azurerm_frontdoor" "main" {
      + backend_pool_health_probes           = (known after apply)
      + backend_pool_load_balancing_settings = (known after apply)
      + backend_pools                        = (known after apply)
      + cname                                = (known after apply)
      + explicit_resource_order              = (known after apply)
      + friendly_name                        = "hmcts-test-sbox"
      + frontend_endpoints                   = (known after apply)
      + header_frontdoor_id                  = (known after apply)
      + id                                   = (known after apply)
      + load_balancer_enabled                = true
      + name                                 = "hmcts-test-sbox"
      + resource_group_name                  = "lz-stg-rg"
      + routing_rules                        = (known after apply)
      + tags                                 = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + backend_pool {
          + health_probe_name   = "defaultHealthProbe"
          + id                  = (known after apply)
          + load_balancing_name = "defaultLoadBalancing"
          + name                = "defaultBackend"

          + backend {
              + address     = "www.bing.com"
              + enabled     = true
              + host_header = "www.bing.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-toffee"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-toffee"
          + name                = "toffee"

          + backend {
              + address     = "firewall-prod-int-palo-sdsstg.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "toffee.staging.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-c100-application"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-c100-application"
          + name                = "c100-application"

          + backend {
              + address     = "firewall-prod-int-palo-sdsstg.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "c100-application.staging.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pip-frontend"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-pip-frontend"
          + name                = "pip-frontend"

          + backend {
              + address     = "firewall-prod-int-palo-sdsstg.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pip-frontend.staging.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pip-frontend-b2c-sign-in"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-pip-frontend-b2c-sign-in"
          + name                = "pip-frontend-b2c-sign-in"

          + backend {
              + address     = "hmctspipnonprod.b2clogin.com"
              + enabled     = true
              + host_header = "hmctspipnonprod.b2clogin.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pip-frontend-b2c-staff"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-pip-frontend-b2c-staff"
          + name                = "pip-frontend-b2c-staff"

          + backend {
              + address     = "hmctspipnonprod.b2clogin.com"
              + enabled     = true
              + host_header = "hmctspipnonprod.b2clogin.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-video-web"
          + name                = "vh-video-web"

          + backend {
              + address     = "firewall-prod-int-palo-sdsstg.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "video.staging.hearings.reform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-admin-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-admin-web"
          + name                = "vh-admin-web"

          + backend {
              + address     = "firewall-prod-int-palo-sdsstg.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "admin.staging.hearings.reform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-casetracker"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-casetracker"
          + name                = "staging-casetracker"

          + backend {
              + address     = "dualstack.civil-loadb-105un4gbv5077-2040046462.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.casetracker.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-certificatedbailiffs"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-certificatedbailiffs"
          + name                = "staging-certificatedbailiffs"

          + backend {
              + address     = "dualstack.certi-loadb-vzujs6ulbuut-415542592.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.certificatedbailiffs.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-courtfines"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-courtfines"
          + name                = "staging-courtfines"

          + backend {
              + address     = "dualstack.court-loadb-qpahtenf925i-482204730.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.courtfines.direct.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-immigrationappealsonline"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-immigrationappealsonline"
          + name                = "staging-immigrationappealsonline"

          + backend {
              + address     = "dualstack.iacfees-s-ELBhmcts-DGD2EJ56UXEF-715536071.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.immigrationappealsonline.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-sds-api-mgmt"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-sds-api-mgmt"
          + name                = "sds-api-mgmt"

          + backend {
              + address     = "firewall-prod-int-palo-sdsapimgmtstg.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "sds-api-mgmt.staging.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-land-reg-division"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-land-reg-division"
          + name                = "staging-trib-land-reg-division"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.landregistrationdivision.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-immigration-svcs"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-immigration-svcs"
          + name                = "staging-trib-immigration-svcs"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.immigrationservices.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-info-rights"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-info-rights"
          + name                = "staging-trib-info-rights"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.informationrights.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-admin-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-admin-appeals"
          + name                = "staging-trib-admin-appeals"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.administrativeappeals.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-care-standards"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-care-standards"
          + name                = "staging-trib-care-standards"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.carestandards.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-lands-chamber"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-lands-chamber"
          + name                = "staging-trib-lands-chamber"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.landschamber.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-finance-tax"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-finance-tax"
          + name                = "staging-trib-finance-tax"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.financeandtax.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-employment-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-employment-appeals"
          + name                = "staging-trib-employment-appeals"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.employmentappeals.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-tansport-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-tansport-appeals"
          + name                = "staging-trib-tansport-appeals"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.transportappeals.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-staging-trib-cicap"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-staging-trib-cicap"
          + name                = "staging-trib-cicap"

          + backend {
              + address     = "dts-trib-staging-556942830.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "staging.cicap.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-portal-stg"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-portal-stg"
          + name                = "portal-stg"

          + backend {
              + address     = "pre-stg1.powerappsportals.com"
              + enabled     = true
              + host_header = "portal-stg.pre-recorded-evidence.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-darts-portal"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-darts-portal"
          + name                = "darts-portal"

          + backend {
              + address     = "firewall-prod-int-palo-sdsstg.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "darts-portal.staging.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "defaultHealthProbe"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-toffee"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-c100-application"
          + path                = "/status"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pip-frontend"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pip-frontend-b2c-sign-in"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pip-frontend-b2c-staff"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled  

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

_firewall_policy.custom["staging-courtfines"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingcourtfinessbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-immigrationappealsonline"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingimmigrationappealsonlinesbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-admin-appeals"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribadminappealssbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-care-standards"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribcarestandardssbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__EVENTVALIDATION"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "drpMainCategory"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "InitialBodyContents"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-cicap"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribcicapsbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-employment-appeals"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribemploymentappealssbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-finance-tax"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribfinancetaxsbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "InitialBodyContents"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "txtClaimant"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }

          + override {
              + rule_group_name = "LFI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "930110"
                }
            }
          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942430"
                }
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-immigration-svcs"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribimmigrationsvcssbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-info-rights"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribinforightssbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__VIEWSTATE"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__EVENTVALIDATION"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "ddlTax3"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "ddlTax2"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-land-reg-division"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtriblandregdivisionsbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "AllowAllAdmin"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "/Admin",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "ddlScat1"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "__EVENTVALIDATION"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-lands-chamber"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtriblandschambersbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["staging-trib-tansport-appeals"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "stagingtribtansportappealssbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "btnSearch"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["toffee"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "toffeesbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebsbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebsbox"
      + resource_group_name   = "lz-stg-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

Plan: 40 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":475,"Program":"tfcmt","SHA1":"","Target":"stg-frontdoor","Vars":{}} -->